parsing-tech-log/src/InformationRegisters/НастройкиПользователя/НастройкиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователя</name>
  <resources>
    <name>ИмяСтиля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

parsing-tech-log/src/CommonModules/ПользователиСервер/Module.bsl
Функция ВходЗапрещен() Экспорт
	
	Возврат ПараметрыСеанса.ТекущийПользователь.Недействителен;
	
КонецФункции


Процедура УстановитьГлавныйСтильИзНастроек() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.ИмяСтиля КАК ИмяСтиля
	|ИЗ
	|	РегистрСведений.НастройкиПользователя КАК Т
	|ГДЕ
	|	Т.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ИмяСтиля = Выборка.ИмяСтиля;
		Если ЗначениеЗаполнено(ИмяСтиля) Тогда
			Попытка
				Стиль = БиблиотекаСтилей[ИмяСтиля];
				ГлавныйСтиль = Стиль;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
